Autodesk.Revit.DB.TemporaryViewModes.CustomColor
Custom color for the TemporaryViewProperties mode.
Remarks:
If custom title is not empty, Temporary View Properties mode displays the colored view frame in custom color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.TemporaryViewModes.CustomTitle
Custom title for the TemporaryViewProperties mode.
Remarks:
If custom title is not empty, Temporary View Properties mode displays it in the upper left corner of colored view frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.TemporaryViewModes
A data structure containing data related to temporary view modes.
Remarks:
The class contains methods and properties to manipulate states
of various temporary view modes that may or may not be avilable
in any of visible views of a Revit document. The temporary modes are
enumerated in the Autodesk.Revit.DB.TemporaryViewMode
class.
Every view that supports temporary view modes owns an instance
of this TemporaryViewModes class, which can be obtained by
accessing the Autodesk.Revit.DB.View.TemporaryViewModes
property of the Autodesk.Revit.DB.View class.
Note that views which do not support temporary modes will have that
property's value be Null.
Multiple temporary view modes can coexist.
Also, TemporaryViewProperties mode can be customized to display custom title and custom color.
Setting custom title and color affects only TemporaryViewProperties mode for the specific view.
Autodesk::Revit::DB::TemporaryViewMode::CustomTitleAutodesk::Revit::DB::TemporaryViewMode::CustomColorAutodesk::Revit::DB::TemporaryViewMode::IsCustomizedAutodesk::Revit::DB::TemporaryViewMode::RemoveCustomization
Since:
2016 Subscription Update